//=================================================================================//  
/***********************************************************************************/   
//---------------------------------------------------------------------------------// 
/** \file                                                                                            
*  File Name  : user_control.h                                                                           
*  Author     : CMS Appliction Team                                                                  
*  Version    : 第二代风机软件平台                                                                               
*  Date       : 01/05/2022                                                                           
** Description: 本页参数为调速电机控制常用参数。                     
**              该版本适用于落地扇/空气净化器等产品。                                                                    
//---------------------------------------------------------------------------------// 
************************************************************************************/ 
//=================================================================================//  
#ifndef  __USER_CONTROL_H__
#define  __USER_CONTROL_H__

//==============================================================================/ 
// 代码对齐方式：Edit--Configuration--Editor--C/C++Files--Tab size = 2
//------------------------------------------------------------------------------/

// 硬件：  CMS32M6526CGE24SS_风扇板
// 软件：  CMS32M6526CGE24SS_落地扇空净平台V200_20230608
// 电机库：CMS_65_FOCA_V200

//==============================================================================/ 
//=============================公共通用参数配置开始=============================/ 

// 上电延时---重要：正式程序要改为300
#define   POWERON_DELAY_TIME                        (3000)

//------------------------------------------------------------------------------/
// 在线仿真模式，实际应用需关闭仿真 -- Motor_Debug_Offline
#define   Motor_Debug_Offline                       (0)													// 关闭在线仿真
#define   Motor_Debug_Online                        (1)													// 在线仿真
#define   Motor_Debug_Mode                          (Motor_Debug_Online)

//------------------------------------------------------------------------------//
// 安规测试模式选择 重要：正式程序必需关闭安规测试模式
#define   SAFE_TEST_DISABLE                         (0)													// 关闭安规测试模式
#define   SAFE_TEST_ENABLE                          (1)													// 开启安规测试模式
#define   CONFIG_SAFE_TEST_MODE                     (SAFE_TEST_DISABLE)

//------------------------------------------------------------------------------//
// PCB Hall表格选择 
#define   PCB_Hall_Type_1                           (0)													// 异形板
#define   PCB_Hall_Type_2                           (1)													// 八角板
#define   Config_PCB_Hall_Mode                      (PCB_Hall_Type_1)

//------------------------------------------------------------------------------/
// 启动方式
#define   Start_Hall                                (0)													// 有感启动
#define   Start_Sensorless                          (1)													// 无感启动
#define   Config_Start_Mode                         (Start_Sensorless)

//----------------------------------------------------------------------------—-//
//调速控制方式 
#define   Speed_Loop                                (0)               					// 速度环
#define   VQ_Loop                                   (1)               					// VQ电压环
#define   Current_Loop                              (2)               					// 电流环
#define   Power_Loop                                (3)               					// 功率环
#define   Config_Contorl_Mode                       (Speed_Loop)

//------------------------------------------------------------------------------/
// 电机转向
#define   FR_CW                                     (0)					
#define   FR_CCW                                    (1)					
#define   Config_Motor_FR                           (FR_CW)							    	// 电机运行方向切换

//------------------------------------------------------------------------------/
// 休眠功能
#define   Sleep_Disable                             (0)													// 休眠功能关闭
#define   Sleep_Enable                              (1)													// 休眠功能开启
#define   Sleep_Control_Mode                        (Sleep_Disable)

//------------------------------------------------------------------------------/
// 正反转功能
#define   Motor_ZF_Disable                          (0)													// 正反转功能关闭
#define   Motor_ZF_Enable                           (1)													// 正反转功能开启
#define   Motor_ZF_Control_Mode                     (Motor_ZF_Disable)

//------------------------------------------------------------------------------/
// Brake刹车功能
#define   Brake_Disable                             (0)													// 刹车功能关闭
#define   Brake_Enable                              (1)													// 刹车功能开启
#define   Brake_Control_Mode                        (Brake_Disable)

// Brake刹车转速
#define   Motor_Brake_Speed                         (2000)										  // Brake 刹车转速 单位：Rpm
#define   Motor_Brake_Time                          (4000)											// Brake 刹车停止时间 单位：ms

//------------------------------------------------------------------------------/
// 故障保护重启机制
#define   Motor_Restart_Disable                     (0)													// 故障保护需要调速信号重启恢复
#define   Motor_Restart_Enable                      (1)													// 故障保护后自动重启
#define   Motor_Restart_Mode                        (Motor_Restart_Disable)

//------------------------------------------------------------------------------/
// 声音补偿
#define   Dead_Disable                              (0)													// 关闭补偿
#define   Dead_Enable                               (1)													// 死区补偿
#define   Harm_Enable                               (2)													// 谐波补偿
#define   DeadComp_Mode                             (Dead_Disable)

//==============================================================================/   
// 速度调节方式
#define   VSP_Control                               (0)													// 电压信号调速
#define   PWM_Control                               (1)													// 占空比信号调速
#define   CLK_Control                               (2)													// 频率信号调速
#define   Debug_Control                             (3)													// 调试用，给固定值
#define   Speed_Control_Mode                        (PWM_Control)

//------------------------------------------------------------------------------/ 
//（注：速度环控制模式下调试参数，VQ环不用调试该参数）
// VSP/PWM启动转速与最大运行转速参数
#if (Config_Contorl_Mode != VQ_Loop)
#define   SPEED_START                               (450)											  // 启动速度（需高于电机停止速度）
#define   SPEED_MAX                                 (2000)											// 最大速度
#endif

//------------------------------------------------------------------------------/
// 速度锁定模式
#define   Lock_Speed_Disable                        (0)       									// 速度锁定关闭
#define   Lock_Speed_Enable                         (1)   											// 速度锁定开启
#define   Lock_Speed_Mode                           (Lock_Speed_Disable)

//------------------------------------------------------------------------------/
// VSP速度控制
#define   VSP_REF_L                                 (0.6)                       // 停止电压点（V）
#define   VSP_REF_M                                 (0.8)			                	// 启动电压点（V）
#define   VSP_REF_H                                 (4.5) 				              // 最大电压点（V）
#define   VSP_SPEED_START                           (SPEED_START)								// 启动速度或VQ值（需高于电机停止速度）
#define   VSP_SPEED_MAX                             (SPEED_MAX)									// 最大速度或最大VQ值

//------------------------------------------------------------------------------/
// PWM速度控制
#define   PWM_REF_L                                 (120)												// 停止占空比（千分位）
#define   PWM_SPEED_HOLD                            (160)												// 启动占空比（千分位）
#define   PWM_REF_M                                 (200)												// 保持占空比（千分位）
#define   PWM_REF_H                                 (900)												// 最大占空比（千分位）
#define   PWM_SPEED_START                           (SPEED_START)								// 启动速度或VQ值（需高于电机停止速度）
#define   PWM_SPEED_MAX                             (SPEED_MAX)									// 最大速度或最大VQ值

//------------------------------------------------------------------------------/
// CLK速度控制
#define   CLK_REF_L                                 (30)												// 停止频率(HZ)
#define   CLK_REF_M                                 (45)												// 启动频率(HZ)
#define   CLK_REF_H                                 (500)												// 最大频率(HZ) 

//==============================================================================/ 
// 电机参数
#define   MOTOR_PAIRS                               (5)            							// 电机极对数 单位：Poles

//#define   MOTOR_RS                                  (0.395)         					// 电机相电阻 单位：Ω 3.5
//#define   MOTOR_LS                                  (0.000705)     						// 电机相电感 单位：H 0.0062
#define   MOTOR_RS                                  (0.8)         					// 电机相电阻 单位：Ω 3.5
#define   MOTOR_LS                                  (0.0015)     						// 电机相电感 单位：H 0.0062
//------------------------------------------------------------------------------/
// 硬件参数
#define   HW_VBUS_VOLT                              (24)           							// 母线电压 单位：V

#define   HW_PHASE_RES                              (0.05)         						// 相采样电阻 单位：Ω
#define   HW_IBUS_RES                               (0.05)         						// 母线采样电阻 单位：Ω

//------------------------------------------------------------------------------/
//正常程序
#if (CONFIG_SAFE_TEST_MODE == SAFE_TEST_DISABLE)
#define   MAX_VOLTAGE_VECTOR                        (0.85)         							// 占空比开度
#endif

//==============================================================================/ 
// 无感启动参数
#define   START_CURRENT_INIT                        (0.05)     							    // 启动电流初始值
#define   START_CURRENT_FINAL                       (0.15)     							    // 启动电流最大限值

#define   START_IRAMP                             	(10)            						// 启动电流爬坡周期 

//------------------------------------------------------------------------------/
#define   START_EKP                                 (8000)      								// 启动估算器KP,1000~10000
#define   START_EKI                                 (0)   											// 启动估算器KI,0~1000

#define   START_EOUT_MIN                            (2)   											// 启动初始角速度

#define   START_SRAMP                             	(1)            						  // 启动估算器估算周期

//==============================================================================/ 
// 运行挡位速度
#define   FOC_RUN_SPEED_MIN                         (200)   										// 电机运行最低转速（最小挡位转速）
#define   FOC_RUN_SPEED_MAX                         (2000)   										// 电机运行最高转速（最大挡位转速）

//------------------------------------------------------------------------------/
// 相位补偿角
#define   FOC_OFFSET_ANGLE                          (0)													// FOC补偿角 单位：° 范围-360° -360°

//==============================================================================/
// 故障保护参数
//正常程序
#if (CONFIG_SAFE_TEST_MODE == SAFE_TEST_DISABLE)
#define   FAULT_BLOCK_TIME                          (2000)         							// 堵转判别时间 单位：ms
#define   FAULT_START_FAIL_TIME                     (6)           							// 启动失败判别时间 单位：s
#endif
//------------------------------------------------------------------------------/

#define   FAULT_RESTART_DELAY_TIME                  (1)            							// 故障保护重启间隔时间 单位：s
#define   FAULT_RESTART_TIMES                       (0)            							// 故障重启次数

//------------------------------------------------------------------------------/
// 堵转保护参数
#define   FAULT_SPEED_MAX                           (3500)         							// 堵转保护最大转速值
#define   FAULT_SPEED_MIN                           (100)          							// 堵转保护最小转速值

//------------------------------------------------------------------------------/
// 运行参数（运行相电流限制值）
#define   FOC_RUN_CURRENT_MIN                       (0.05)   					        	// 电机运行最小相电流峰值
#define   FOC_RUN_CURRENT_MAX                       (3.5)   						      	// 电机运行最大相电流峰值

// 过流保护参数
#define   FAULT_OVER_CURRENT                        (7.0)   					        	// 软件过流保护值 单位：A
#define   FAULT_HARD_OVER_CURRENT                   (8.0)   				    	   		// 硬件过流保护值 单位：A

//------------------------------------------------------------------------------/
// 电压保护参数                                                                                        
#define   FAULT_VBUS_OVOT                           (28)           							// 过压保护值 单位：V                      
#define   FAULT_VBUS_UVOT                           (18)           						  // 欠压保护值 单位：V                        
#define   FAULT_VBUS_OV_REV                         (26)           							// 过压保护恢复值 单位：V                     
#define   FAULT_VBUS_UV_REV                         (20)           						// 欠压保护恢复值 单位：V                  

//------------------------------------------------------------------------------/ 
// 故障保护使能
#define   FAULT_BLOCK_ENABLE                        (1)            							// 堵转保护使能  
#define   FAULT_PHASELOSS_ENABLE                    (1)            							// 缺相保护使能  
#define   FAULT_VOLTAGE_ENABLE                      (1)            							// 电压保护使能  

//=============================公共通用参数配置结束=============================/


//=======================速度环控制配置以及调试参数开始=========================/ 
//  （注：VQ电压环控制模式下不用调试以下参数）
#if (Config_Contorl_Mode != VQ_Loop)
//------------------------------------------------------------------------------/ 
// 加减速参数
#define   SPEED_RAMP_INC                            (20)           							// 速度爬坡曲线，加速斜率
#define   SPEED_RAMP_DEC                            (50)           							// 速度爬坡曲线，下降斜率
#endif
//------------------------------------------------------------------------------/
// 速度环PI参数
#define   FOC_WKP                                   (1.0)      							    // 速度环KP ( 0.1~2.0 )
#define   FOC_WKI                                   (0.02)    						    	// 速度环KI ( 0.001~0.05 )
#define   FOC_WKD                                   (1.0)    							    	// 速度环KD ( 0.1~2.0 )

//========================速度环控制配置以及调试参数结束========================/ 


//=========================VQ环控制配置以及调试参数开始=========================/
//  （注：速度环控制模式下不用调试以下参数）
#if (Config_Contorl_Mode == VQ_Loop)
// VSP/PWM/CLK启动VQ值与最大运行VQ值参数
#define   SPEED_START                               _Q15(VQ_RUN_VOLTAGE_MIN)		// 启动VQ值（需高于电机停止速度）
#define   SPEED_MAX                                 _Q15(VQ_RUN_VOLTAGE_MAX)		// 最大VQ值

//------------------------------------------------------------------------------/
// 加减速参数
#define   SPEED_RAMP_INC                            (20)           							// 速度爬坡曲线，加速斜率
#define   SPEED_RAMP_DEC                            (50)           							// 速度爬坡曲线，下降斜率
#endif
//------------------------------------------------------------------------------/
// 运行参数
#define   VQ_RUN_VOLTAGE_MIN                        (0.06)											// 电机运行Vq最小值 范围(0~1) 根据实际应用填入该值 
#define   VQ_RUN_VOLTAGE_MAX                        (0.50)											// 电机运行Vq最大值 范围(0~1) 根据实际应用填入该值 

//------------------------------------------------------------------------------/ 
// VQ模式限制参数
#define   VQ_LOOP_LIMIT_SPEED_VALUE                 (4000)           				  	//  限制最大转速值 单位：RPM
#define   VQ_LOOP_LIMIT_CURRENT_VALUE               (3.0)												//  限制最大相电流值 单位：A

//=========================VQ环控制配置以及调试参数结束=========================/

//======================安规堵转版本程序配置以及调试参数开始====================/

//------------------------------------------------------------------------------//
// 安规程序工作模式选择 
#define   SAFE_TEST_MODE_1                          (0)         								// 安规堵转模式1 测试温升
#define   SAFE_TEST_MODE_2                          (1)         								// 安规堵转模式2 MOS器件损坏
#define   CONFIG_SAFE_WORK_MODE                     (SAFE_TEST_MODE_1)

// 安规程序占空比设定 (注意安规的占空比要慢慢的放开，从小到大，防止电流太大烧东西)
#if (CONFIG_SAFE_WORK_MODE == SAFE_TEST_MODE_1)
#define   SAFE_MODE_VOLTAGE_DUTY                    _Q15(0.15)         					// 安规堵转占空比开度
#else
// (注：马达参数较大时，会出现占空比为1时也烧不了马达，建议安规程序工作模式使用安规堵转模式1的方式)
#define   SAFE_MODE_VOLTAGE_DUTY                    _Q15(0.35)         					// 安规堵转占空比开度
#endif

//------------------------------------------------------------------------------/
#if (CONFIG_SAFE_TEST_MODE == SAFE_TEST_ENABLE)
//------------------------------------------------------------------------------//
//  (注：堵转时若马达抖动频率过快，可通过减小该参数以达到降低马达抖动频率；
//     若堵转一段时间后松开，马达运行转速很低且母线电流较大时，可通过增大该参数使马达正常运行。)
#define   SAFE_MODE_KP_LIMIT                        (4200)         							// 安规堵转角度估算KP限制值

//------------------------------------------------------------------------------/
// (注：默认参数不用修改)
#define   MAX_VOLTAGE_VECTOR                        (1.00)         							// 占空比开度

//------------------------------------------------------------------------------/
// (注：默认参数不用修改)
#define   FAULT_BLOCK_TIME                          (300)         							// 堵转判别时间 单位：ms
#define   FAULT_START_FAIL_TIME                     (3)           							// 启动失败判别时间 单位：s
#endif

//======================安规堵转版本程序配置以及调试参数结束====================/

//==============================================================================//  

#endif	 /* __USER_CONTROL_H__ */

